const vegetables = [{
    id: 101,
    name: 'アスパラガス',
    img:'img/vegetable/asupara.png',
    season: '冬',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 102,
    name: 'カリフラワー',
    img:'img/vegetable/karihurawa.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 103,
    name: '小松菜',
    img:'img/vegetable/komatuna.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 104,
    name: 'キャベツ',
    img:'img/vegetable/kyabetu.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 105,
    name: 'ナス',
    img:'img/vegetable/nasu.png',
    season: '夏',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 106,
    name: 'ニンジン',
    img:'img/vegetable/ninjin.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 107,
    name: 'オクラ',
    img:'img/vegetable/okura.png',
    season: '夏',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 108,
    name: 'レタス',
    img:'img/vegetable/retasu.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 109,
    name: 'サツマイモ',
    img:'img/vegetable/satumaimo.png',
    season: '秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 110,
    name: 'シイタケ',
    img:'img/vegetable/siitake.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 111,
    name: '生姜',
    img:'img/vegetable/syouga.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 112,
    name: '玉ねぎ',
    img:'img/vegetable/tamanegi.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 113,
    name: 'トマト',
    img:'img/vegetable/tomato.png',
    season: '夏',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 114,
    name: 'トウモロコシ',
    img:'img/vegetable/toumorokosi.png',
    season: '夏',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 115,
    name: 'インゲン豆',
    img:'img/vegetable/ingen.png',
    season: '春、秋',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },
  {
    id: 116,
    name: '大根',
    img:'img/vegetable/daikon.png',
    season: '冬',
    eat: 'おすすめの調理法',
    point: 'めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。めっちゃおいしい野菜焼いても茹でても生でもおいしい。オーガニックの農家自慢の野菜です。'
  },


  ];
  
  
  
  new Vue({
    el: '#list',
    data: {
      showContent: false,
      vegetableData: vegetables,
      currentVegetable: {},
    },
    
    methods: {
      selectVegetable(id) {
        const vegetable = vegetables.find((v) => v.id === id);
        this.currentVegetable = vegetable;
        console.log(this.currentVegetable);
      },
  
      openModal(id, e) {
        this.showContent = true;
        console.log(id);
        this.selectVegetable(id);
      },
      
      closeModal() {
        this.showContent = false;
        this.currentVegetable = {};
      },
    },
  });
  